{
    "summaryText": "Wow, what a powerful message delivered by Pastor Darrison Tellez about getting backup from God! In this incredible sermon, Pastor Darrison walks us through the story of Joshua and reveals an amazing truth: God is fighting harder for us than we are fighting for ourselves. Can you imagine that? Sometimes we feel alone in our struggles, but God is working behind the scenes, orchestrating details we can't even see! Drawing from Joshua's incredible story, Pastor Darrison shares a personal testimony about a mall shooting where God's protection was evident in the smallest details - from his daughter's repeated escalator rides to a manager's unexpected help. The sermon reminds us that God isn't just interested in the big picture, but He delights in every single detail of our lives. Pastor Darrison challenges us to pray bigger, have faith that seems impossible, and understand that our fight isn't just physical - it's spiritual. The most powerful moment? When he declares that Jesus is our ultimate backup, the one who came down from heaven to fight our battles and cover our backs. Whether you're facing a health issue, family struggle, or career challenge, God is saying, 'You're going to make it!'",
    "tags": [
        "Faith",
        "Prayer",
        "Healing"
    ],
    "mainPoints": [
        "God gives you the outcome before the battle begins",
        "God fights harder for you than you fight for yourself",
        "The finality of your fight is directly connected to the level of your faith"
    ],
    "versesMentioned": [
        {
            "verse": "Joshua 10:8",
            "text": "Do not be afraid of them, the Lord said to Joshua, for I have given you victory over them. Not a single one of them will be able to stand up against you.",
            "version": "NIV"
        },
        {
            "verse": "Psalm 37:23-24",
            "text": "The Lord directs the steps of the godly. He delights in every detail of their lives. Though they stumble, they will never fall, for the Lord holds them by the hand.",
            "version": "NLT"
        },
        {
            "verse": "Joshua 10:11",
            "text": "As the Amorites retreated down the road from Beth Horon, the Lord destroyed them with a terrible hailstorm from heaven, killing them all along the way to Azekah. More of the enemy died from the hailstones than the Israelites killed with the sword.",
            "version": "NIV"
        },
        {
            "verse": "Romans 10:9",
            "text": "If you declare with your mouth, 'Jesus is Lord,' and believe in your heart that God raised him from the dead, you will be saved.",
            "version": "NIV"
        }
    ],
    "dailyActionPlan": {
        "Monday": {
            "scripture": "Psalm 34:18: 'The Lord is close to the brokenhearted and saves those who are crushed in spirit.'",
            "focus": "Recognizing God's presence in our personal battles",
            "action": "Write down a current struggle you're facing. Spend time reflecting on how God might be working in the details of this situation, even if you can't see it yet.",
            "prayer": "Lord, help me trust that You are fighting for me, even in the moments I feel alone. Open my eyes to see Your hand at work in my life. Give me faith to believe You are working out every detail. Amen."
        },
        "Tuesday": {
            "scripture": "Isaiah 41:10: 'So do not fear, for I am with you; do not be dismayed, for I am your God. I will strengthen you and help you; I will uphold you with my righteous right hand.'",
            "focus": "Understanding God's commitment to fighting our battles",
            "action": "Make a list of areas where you've been trying to fight alone. Surrender each of these areas to God, asking Him to be your backup and fight on your behalf.",
            "prayer": "God, I release my need to control and fight alone. Fill me with Your peace and help me trust that You are fighting for me. Show me how to walk in faith instead of fear. Amen."
        },
        "Wednesday": {
            "scripture": "2 Chronicles 20:15: 'Do not be afraid or discouraged because of this vast army. For the battle is not yours, but God's.'",
            "focus": "Recognizing spiritual warfare and God's ultimate victory",
            "action": "Identify one area of your life where you feel overwhelmed. Spend time in prayer, asking God to reveal His strategy and fight on your behalf.",
            "prayer": "Heavenly Father, I acknowledge that my battles are not my own. I invite Your supernatural intervention and trust in Your victory. Give me wisdom to partner with Your plan. Amen."
        },
        "Thursday": {
            "scripture": "Exodus 14:14: 'The Lord will fight for you; you need only to be still.'",
            "focus": "Learning to rest in God's protection",
            "action": "Practice stillness today. When anxiety or fear rises, pause and remind yourself that God is fighting for you. Take deep breaths and choose peace.",
            "prayer": "Lord, teach me to be still and know that You are God. Help me quiet my anxious thoughts and trust in Your protection. Remind me that You are always working on my behalf. Amen."
        },
        "Friday": {
            "scripture": "Deuteronomy 1:30: 'The Lord your God, who is going before you, will fight for you, as he did for you in Egypt, before your very eyes.'",
            "focus": "Remembering God's past faithfulness",
            "action": "Journal about times God has fought for you in the past. Use these memories as fuel for faith in your current battles.",
            "prayer": "God, thank You for Your faithfulness. Remind me of the times You've shown up and fought for me. Increase my faith and help me trust You completely. Amen."
        },
        "Saturday": {
            "scripture": "1 Samuel 17:47: 'All those gathered here will know that it is not by sword or spear that the Lord saves; for the battle is the Lord's, and he will give all of you into our hands.'",
            "focus": "Surrendering our battles to God",
            "action": "Create a 'surrender list' - write down your current battles and physically give them to God, symbolically releasing your grip and trusting Him.",
            "prayer": "Lord, I surrender my battles to You. I acknowledge that victory comes not by my own strength, but by Your power. Fill me with faith and help me trust Your plan completely. Amen."
        }
    },
    "videoUrl": "https://www.youtube.com/embed/WdOdHNUwg9I"
}