{
    "summaryText": "Wow, what a powerful message from Montell and Kristin Jordan about transforming marriage from 'me' to 'we'! In this incredible sermon, they break down the journey of creating a godly, covenant marriage through five transformative stops: submission, sequence, being sold out, sacrifice, and service. Isn't it amazing how they challenge our cultural norms and invite us to see marriage as a divine partnership? Pastor Montell hilariously demonstrates this with a toilet seat illustration that had the whole congregation laughing while learning a profound lesson about prioritizing your spouse. The Jordans aren't just talking theory - they're sharing from decades of real-life experience, showing how choosing marriage over individual desires can create something miraculous. The core message? Marriage isn't about losing yourself, but about upgrading your identity through Christ-centered love. They powerfully remind us that only God can truly complete us, and when two people bring their 'whole 110%' to a relationship, something supernatural happens!",
    "tags": [
        "Relationships",
        "Marriage",
        "Love"
    ],
    "mainPoints": [
        "Transform marriage from 'me' to 'we'",
        "Prioritize your spouse above personal desires",
        "Create a Christ-centered partnership"
    ],
    "versesMentioned": [
        {
            "verse": "Ephesians 2:10",
            "text": "For we are God's masterpiece, created in Christ Jesus to do good things he planned for us long ago.",
            "version": "NLT"
        },
        {
            "verse": "Genesis 2:22-25",
            "text": "Then the Lord God made a woman from the rib he had taken out of the man, and he brought her to the man. The man said, 'This is now bone of my bones and flesh of my flesh; she shall be called woman, for she was taken out of man.' That is why a man leaves his father and mother and is united to his wife, and they become one flesh. Adam and his wife were both naked, and they felt no shame.",
            "version": "NIV"
        },
        {
            "verse": "1 Corinthians 11:1-3",
            "text": "Follow my example, as I follow the example of Christ. I praise you for remembering me in everything and for holding to the traditions just as I passed them on to you. But I want you to realize that the head of every man is Christ, and the head of the woman is man, and the head of Christ is God.",
            "version": "NIV"
        },
        {
            "verse": "Romans 12:1",
            "text": "Therefore, I urge you, brothers and sisters, in view of God's mercy, to offer your bodies as a living sacrifice, holy and pleasing to God—this is your true and proper worship.",
            "version": "NIV"
        },
        {
            "verse": "Matthew 20:28",
            "text": "Just as the Son of Man did not come to be served, but to serve, and to give his life as a ransom for many.",
            "version": "NIV"
        },
        {
            "verse": "Romans 10:9-10",
            "text": "If you declare with your mouth, 'Jesus is Lord,' and believe in your heart that God raised him from the dead, you will be saved. For it is with your heart that you believe and are justified, and it is with your mouth that you profess your faith and are saved.",
            "version": "NIV"
        }
    ],
    "dailyActionPlan": {
        "Monday": {
            "scripture": "Ephesians 5:25: 'Husbands, love your wives, just as Christ loved the church and gave himself up for her.'",
            "focus": "Understanding sacrificial love in marriage",
            "action": "Write down three specific ways you can prioritize your spouse's needs over your own this week. Reflect on how these actions demonstrate Christ-like love.",
            "prayer": "Lord, teach me to love sacrificially. Help me see my spouse through Your eyes and show them the same unconditional love You show me. Guide me to serve without expectation of return. Amen."
        },
        "Tuesday": {
            "scripture": "Proverbs 31:10-11: 'A wife of noble character who can find? She is worth far more than rubies. Her husband has full confidence in her and lacks nothing of value.'",
            "focus": "Building mutual trust and respect",
            "action": "Have an honest, vulnerable conversation with your spouse about your relationship. Listen more than you speak, and seek to understand their heart.",
            "prayer": "God, help me create a safe space in my marriage. Give me wisdom to communicate with love, humility, and genuine care. Restore and strengthen our connection. Amen."
        },
        "Wednesday": {
            "scripture": "1 Peter 4:8: 'Above all, love each other deeply, because love covers over a multitude of sins.'",
            "focus": "Practicing grace and forgiveness",
            "action": "Identify one area where you need to extend grace to your spouse. Choose to respond with understanding instead of defensiveness.",
            "prayer": "Father, teach me to love deeply. Help me see past my spouse's flaws and recognize their heart. Give me grace to forgive as You have forgiven me. Amen."
        },
        "Thursday": {
            "scripture": "Ecclesiastes 4:9-10: 'Two are better than one, because they have a good return for their labor: If either of them falls down, one can help the other up.'",
            "focus": "Creating a true partnership",
            "action": "Plan a joint activity or project that you can do together. Work as a team and celebrate your combined strengths.",
            "prayer": "Lord, help us become true partners. Show us how to support and uplift each other. Bind us together in unity and purpose. Amen."
        },
        "Friday": {
            "scripture": "Colossians 3:13: 'Bear with each other and forgive one another if any of you has a grievance against someone. Forgive as the Lord forgave you.'",
            "focus": "Practicing intentional kindness",
            "action": "Do something unexpected and thoughtful for your spouse. Make it a surprise that shows you've been paying attention to their needs and desires.",
            "prayer": "God, soften my heart. Help me see opportunities to show love in practical ways. Make me attentive to my spouse's unspoken needs. Amen."
        },
        "Saturday": {
            "scripture": "Song of Solomon 8:7: 'Many waters cannot quench love; rivers cannot sweep it away.'",
            "focus": "Recommitting to your marriage covenant",
            "action": "Reflect on your marriage journey. Write a love letter to your spouse expressing gratitude for your relationship and recommitting to your covenant.",
            "prayer": "Heavenly Father, renew our love. Help us continue growing together, always placing You at the center of our relationship. Deepen our connection and remind us of Your original design for marriage. Amen."
        }
    },
    "videoUrl": "https://www.youtube.com/embed/DAamDjKdvWU"
}