{
    "summaryText": "Wow, what an incredible message about resurrection and hope from Pastor Travis Hearn! Drawing from the powerful prophetic book of Ezekiel, PT walks us through an extraordinary passage about dry bones coming back to life. Can you imagine God looking at what seems completely dead in your life and saying, 'I'm going to breathe life into this again'? Pastor Travis powerfully reminds us that just because something looks dead doesn't mean it's actually over. Using the vivid imagery of Ezekiel 37, he challenges us to 'prophesy' - which means speaking God's truth over our situations, declaring life where there seems to be only death. The most powerful moment? When he reminds us that sometimes what looks like something dying is actually just a seed being planted, preparing to grow into something beautiful. Sometimes our 'dead' things are just waiting to be transformed! Pastor Travis beautifully illustrates that God specializes in resurrection - not just of physical bodies, but of dreams, relationships, hopes, and spirits. His message is a powerful reminder that with God, nothing is truly impossible.",
    "tags": [
        "Hope",
        "Faith",
        "Resurrection"
    ],
    "mainPoints": [
        "God can bring life to dead situations",
        "Prophesy (speak truth) over your challenges",
        "What looks dead might be a seed preparing to grow"
    ],
    "versesMentioned": [
        {
            "verse": "Ezekiel 37:1-14",
            "text": "The hand of the Lord was on me, and he brought me out by the Spirit of the Lord and set me in the middle of a valley; it was full of bones. He led me back and forth among them, and I saw a great many bones on the floor of the valley, bones that were very dry.",
            "version": "NIV"
        },
        {
            "verse": "Psalm 139:16",
            "text": "Your eyes saw my unformed body; all the days ordained for me were written in your book before one of them came to be.",
            "version": "NIV"
        },
        {
            "verse": "Isaiah 55:8-9",
            "text": "'For my thoughts are not your thoughts, neither are your ways my ways,' declares the Lord. 'As the heavens are higher than the earth, so are my ways higher than your ways and my thoughts than your thoughts.'",
            "version": "NIV"
        },
        {
            "verse": "John 14:6",
            "text": "Jesus answered, 'I am the way and the truth and the life. No one comes to the Father except through me.'",
            "version": "NIV"
        },
        {
            "verse": "Proverbs 18:21",
            "text": "The tongue has the power of life and death, and those who love it will eat its fruit.",
            "version": "NIV"
        },
        {
            "verse": "John 12:24",
            "text": "Very truly I tell you, unless a kernel of wheat falls to the ground and dies, it remains only a single seed. But if it dies, it produces many seeds.",
            "version": "NIV"
        },
        {
            "verse": "2 Corinthians 5:17",
            "text": "Therefore, if anyone is in Christ, the new creation has come: The old has gone, the new is here!",
            "version": "NIV"
        },
        {
            "verse": "Galatians 2:20",
            "text": "I have been crucified with Christ and I no longer live, but Christ lives in me. The life I now live in the body, I live by faith in the Son of God, who loved me and gave himself for me.",
            "version": "NIV"
        }
    ],
    "dailyActionPlan": {
        "Monday": {
            "scripture": "Jeremiah 29:11: 'For I know the plans I have for you,' declares the Lord, 'plans to prosper you and not to harm you, plans to give you hope and a future.'",
            "focus": "Recognizing God's potential in seemingly dead situations",
            "action": "Identify one area in your life that feels 'dead' or hopeless. Write it down, then pray and ask God to show you how He might be preparing it for resurrection or transformation.",
            "prayer": "Lord, help me see beyond my current circumstances. Open my eyes to the potential You see in my life, even when things look impossible. Give me faith to believe in Your resurrection power. Amen."
        },
        "Tuesday": {
            "scripture": "Romans 4:17: 'God who gives life to the dead and calls into being things that were not.'",
            "focus": "Understanding God's ability to create something from nothing",
            "action": "Spend time journaling about a dream or vision you've let die. Ask God to breathe new life into it and show you His perspective.",
            "prayer": "Father, revive the dreams and hopes I've abandoned. Show me Your perspective and help me trust in Your power to resurrect what seems impossible. Amen."
        },
        "Wednesday": {
            "scripture": "Ephesians 3:20: 'Now to him who is able to do immeasurably more than all we ask or imagine, according to his power that is at work within us.'",
            "focus": "Believing in God's supernatural ability to transform",
            "action": "Make a list of areas where you've lost hope. Beside each one, write a declaration of faith about what God could do.",
            "prayer": "God, increase my faith. Help me to see beyond my limitations and trust in Your unlimited power. Give me the courage to believe in resurrection. Amen."
        },
        "Thursday": {
            "scripture": "Joel 2:25: 'I will repay you for the years the locusts have eaten.'",
            "focus": "Trusting God's ability to restore lost time and opportunities",
            "action": "Identify one relationship or opportunity you believe is beyond repair. Pray specifically about how God might restore or redeem it.",
            "prayer": "Lord, I surrender my broken places to You. Show me how You can restore and redeem what seems lost. Give me hope and patience. Amen."
        },
        "Friday": {
            "scripture": "Philippians 1:6: 'Being confident of this, that he who began a good work in you will carry it on to completion until the day of Christ Jesus.'",
            "focus": "Maintaining hope in God's ongoing work",
            "action": "Review your spiritual journey. Write down moments where God has already brought unexpected life and restoration.",
            "prayer": "Father, remind me of Your faithfulness. Help me trust that You are always working, even when I can't see it. Renew my hope today. Amen."
        },
        "Saturday": {
            "scripture": "Isaiah 43:19: 'See, I am doing a new thing! Now it springs up; do you not perceive it? I am making a way in the wilderness and streams in the wasteland.'",
            "focus": "Anticipating God's new work in your life",
            "action": "Spend time in quiet reflection. Ask God to show you where He is preparing to do something new in your life.",
            "prayer": "Lord, open my spiritual eyes. Help me perceive the new things You are doing. Give me faith to embrace Your transformation. Amen."
        }
    },
    "videoUrl": "https://www.youtube.com/embed/NiYnWYnsOsY"
}