{
    "summaryText": "What an incredible Resurrection Sunday message from Pastor Travis Hearn! Using a baseball batting average analogy, PT powerfully illustrated how we all fall short spiritually - batting a zero without Jesus Christ. He shared how Jesus is our ultimate 'pinch hitter', batting a perfect thousand and dying for our sins while we were still sinners. Pastor Travis's personal testimony of surviving a brain aneurysm stroke powerfully demonstrated God's resurrection power - highlighting how God can raise dead things back to life, whether it's physical healing, relationships, or our very souls. The message wasn't just about religious ritual, but about developing a genuine relationship with Jesus Christ. Even preaching in the rain at a baseball stadium, Pastor Travis reminded us that God loves us unconditionally, forgives us completely, and wants a deep, personal relationship with each of us. His own story of transformation - from a partying teenager arrested for a DUI to a passionate pastor - is living proof that no one is too far gone for God's redemptive love.",
    "tags": [
        "Salvation",
        "Faith",
        "Redemption"
    ],
    "mainPoints": [
        "God loves you unconditionally",
        "God forgives you completely",
        "God wants a relationship with you, not just religious observance"
    ],
    "versesMentioned": [
        {
            "verse": "Romans 3:23",
            "text": "For all have sinned and fall short of the glory of God.",
            "version": "NIV"
        },
        {
            "verse": "Romans 5:8",
            "text": "But God demonstrates his own love for us in this: While we were still sinners, Christ died for us.",
            "version": "NIV"
        },
        {
            "verse": "John 15:13",
            "text": "Greater love has no one than this: to lay down one's life for one's friends.",
            "version": "NIV"
        },
        {
            "verse": "John 3:16",
            "text": "For God so loved the world that he gave his one and only Son, that whoever believes in him shall not perish but have eternal life.",
            "version": "NIV"
        },
        {
            "verse": "Luke 24:1-6",
            "text": "On the first day of the week, very early in the morning, the women took the spices they had prepared and went to the tomb. They found the stone rolled away from the tomb, but when they entered, they did not find the body of the Lord Jesus. While they were wondering about this, suddenly two men in clothes that gleamed like lightning stood beside them. In their fright the women bowed down with their faces to the ground, but the men said to them, 'Why do you look for the living among the dead? He is not here; he has risen!'",
            "version": "NIV"
        },
        {
            "verse": "John 11:25",
            "text": "Jesus said to her, 'I am the resurrection and the life. The one who believes in me will live, even though they die.'",
            "version": "NIV"
        }
    ],
    "dailyActionPlan": {
        "Monday": {
            "scripture": "1 Corinthians 15:14: 'And if Christ has not been raised, our preaching is useless and so is your faith.'",
            "focus": "Understanding the power of Christ's resurrection in our daily lives",
            "action": "Reflect on areas in your life that feel 'dead' or hopeless. Write them down and surrender each one to God, believing in His resurrection power.",
            "prayer": "Lord, I believe You can bring life to the dead places in my heart. Give me faith to trust in Your resurrection power and hope for transformation. Amen."
        },
        "Tuesday": {
            "scripture": "Ephesians 2:8-9: 'For it is by grace you have been saved, through faith—and this is not from yourselves, it is the gift of God— not by works, so that no one can boast.'",
            "focus": "Recognizing salvation as a gift, not an achievement",
            "action": "List three ways you've been trying to earn God's love or approval. Spend time meditating on the truth that God's love is unconditional.",
            "prayer": "Father, help me understand Your unconditional love. Forgive me for trying to earn Your approval. I receive Your grace with a thankful heart. Amen."
        },
        "Wednesday": {
            "scripture": "2 Corinthians 5:17: 'Therefore, if anyone is in Christ, the new creation has come: The old has gone, the new is here!'",
            "focus": "Embracing your new identity in Christ",
            "action": "Identify one habit or thought pattern from your 'old self' that you want God to transform. Ask Him for strength to change.",
            "prayer": "Lord Jesus, I surrender my old self to You. Transform my mind, my heart, and my actions. Make me new from the inside out. Amen."
        },
        "Thursday": {
            "scripture": "Romans 8:11: 'And if the Spirit of him who raised Jesus from the dead is living in you, he who raised Christ from the dead will also give life to your mortal bodies because of his Spirit who lives in you.'",
            "focus": "Understanding the resurrection power within you",
            "action": "Pray for someone in your life who needs healing - physically, emotionally, or spiritually. Believe God can work through your prayer.",
            "prayer": "Holy Spirit, work Your resurrection power through me. Use me as an instrument of Your healing and hope. Give me faith to believe for the impossible. Amen."
        },
        "Friday": {
            "scripture": "Galatians 2:20: 'I have been crucified with Christ and I no longer live, but Christ lives in me. The life I now live in the body, I live by faith in the Son of God, who loved me and gave himself for me.'",
            "focus": "Living a life surrendered to Christ",
            "action": "Examine your daily priorities. Where are you living for yourself instead of for Christ? Make one intentional change.",
            "prayer": "Lord, help me decrease so that You may increase. Show me how to live fully surrendered to Your will and purpose. Amen."
        },
        "Saturday": {
            "scripture": "Philippians 3:10: 'I want to know Christ—yes, to know the power of his resurrection and participation in his sufferings, becoming like him in his death.'",
            "focus": "Pursuing a deeper relationship with Jesus",
            "action": "Spend extended time in prayer and worship. Ask God to reveal Himself to you in a new, personal way.",
            "prayer": "Jesus, I don't want to just know about You, I want to truly know You. Draw me closer to Your heart. Reveal Yourself to me in a fresh, powerful way. Amen."
        }
    },
    "videoUrl": "https://www.youtube.com/embed/4Q2_Rt3r5aA"
}