{
    "summaryText": "What a powerful sermon from Pastor Jabin Chavez about moving forward and embracing God's new things! Pastor Chavez challenges us to break free from the limitations of our past and step boldly into God's incredible future. Drawing from Isaiah 43, he reminds us that God is constantly doing something new - but we often miss it by dwelling on what was instead of what could be. Can you imagine how many blessings we might be blocking by constantly looking backward? Pastor Chavez shares personal stories that illustrate how our past experiences, both good and bad, can become barriers to God's remarkable plans. He emphasizes that God is more interested in new beginnings than second chances, and He's always ready to do something unprecedented in our lives. The most striking point? God is bigger than our missed opportunities, our mistakes, and our limitations. Whether you're feeling stuck in past failures or past successes, this message is a powerful reminder that God is saying, 'Behold, I am doing a new thing!' The invitation is clear: forget what lies behind, embrace the present, and see the future God is preparing.",
    "tags": [
        "Faith",
        "Purpose",
        "Transformation"
    ],
    "mainPoints": [
        "Forget the past and stop letting it define your future",
        "Embrace the present moment as holy and meaningful",
        "Learn to see and declare the new thing God is doing"
    ],
    "versesMentioned": [
        {
            "verse": "Isaiah 43:18-19",
            "text": "Forget the former things; do not dwell on the past. See, I am doing a new thing! Now it springs up; do you not perceive it? I am making a way in the wilderness and streams in the wasteland.",
            "version": "NIV"
        },
        {
            "verse": "Deuteronomy 29:19",
            "text": "When such a person hears the words of this oath and they invoke a blessing on themselves, thinking, 'I will be safe, even though I persist in going my own way,' they will bring disaster.",
            "version": "NIV"
        },
        {
            "verse": "Genesis 18:10-14",
            "text": "Then one of them said, 'I will surely return to you about this time next year, and Sarah your wife will have a son.' Now Sarah was listening at the entrance to the tent, which was behind him. Abraham and Sarah were already very old, and Sarah was past the age of childbearing.",
            "version": "NIV"
        },
        {
            "verse": "Exodus 3:5",
            "text": "'Do not come any closer,' God said. 'Take off your sandals, for the place where you are standing is holy ground.'",
            "version": "NIV"
        },
        {
            "verse": "Psalm 90:12",
            "text": "Teach us to number our days, that we may gain a heart of wisdom.",
            "version": "NIV"
        },
        {
            "verse": "Joshua 3:4",
            "text": "Then you will know which way to go, since you have never been this way before.",
            "version": "NIV"
        },
        {
            "verse": "Ephesians 3:20",
            "text": "Now to him who is able to do immeasurably more than all we ask or imagine, according to his power that is at work within us.",
            "version": "NIV"
        }
    ],
    "dailyActionPlan": {
        "Monday": {
            "scripture": "Philippians 3:13-14: 'Brothers and sisters, I do not consider myself yet to have taken hold of it. But one thing I do: Forgetting what is behind and straining toward what is ahead, I press on toward the goal to win the prize for which God has called me heavenward in Christ Jesus.'",
            "focus": "Letting go of past limitations",
            "action": "Write down three past experiences that have held you back. Pray over each one, symbolically releasing them to God. Replace each with a positive declaration of what God says about you.",
            "prayer": "Lord, help me release the weight of my past. Give me the courage to see myself as You see me - forgiven, renewed, and full of potential. Guide me into the new thing You are doing in my life. Amen."
        },
        "Tuesday": {
            "scripture": "Isaiah 43:19: 'See, I am doing a new thing! Now it springs up; do you not perceive it? I am making a way in the wilderness and streams in the wasteland.'",
            "focus": "Recognizing God's current work",
            "action": "Take a quiet moment to journal. Ask God to show you the 'new thing' He is doing in your life right now. Listen and write down what comes to your heart.",
            "prayer": "Father, open my spiritual eyes to see the new paths You are creating. Help me to be attentive to Your voice and responsive to Your leading. Amen."
        },
        "Wednesday": {
            "scripture": "2 Corinthians 5:17: 'Therefore, if anyone is in Christ, the new creation has come: The old has gone, the new is here!'",
            "focus": "Embracing personal transformation",
            "action": "Identify one area of your life where you need personal growth. Create a specific, achievable goal that moves you toward positive change.",
            "prayer": "God, I surrender this area of my life to You. Transform me from the inside out. Give me wisdom and strength to become more like Jesus. Amen."
        },
        "Thursday": {
            "scripture": "Romans 12:2: 'Do not conform to the pattern of this world, but be transformed by the renewing of your mind. Then you will be able to test and approve what God's will is—his good, pleasing and perfect will.'",
            "focus": "Renewing your mind",
            "action": "Spend time reading Scripture. Replace one negative thought pattern with a biblical truth. Practice catching and redirecting negative self-talk.",
            "prayer": "Lord, renew my mind. Help me think Your thoughts. Break any mental strongholds and fill me with Your truth and perspective. Amen."
        },
        "Friday": {
            "scripture": "Jeremiah 29:11: 'For I know the plans I have for you,' declares the Lord, 'plans to prosper you and not to harm you, plans to give you hope and a future.'",
            "focus": "Trusting God's plans",
            "action": "List three areas where you're uncertain about the future. Pray over each, intentionally releasing your anxiety and choosing to trust God's plan.",
            "prayer": "Faithful God, I trust Your plans are better than my own. Give me peace that surpasses understanding. Help me walk in confidence, knowing You are directing my steps. Amen."
        },
        "Saturday": {
            "scripture": "Psalm 31:15: 'My times are in your hands; deliver me from the hands of my enemies, from those who pursue me.'",
            "focus": "Surrendering control",
            "action": "Practice a spiritual 'letting go' exercise. Identify an area where you're trying to control the outcome, and consciously surrender it to God.",
            "prayer": "Lord, I surrender my desires, my fears, and my plans to You. Have Your way in my life. I trust Your timing and Your plan. Mold me and make me according to Your will. Amen."
        }
    },
    "videoUrl": "https://www.youtube.com/embed/ky3Nb5iqIqU"
}