{
    "summaryText": "Wow, what a powerful message of healing and wholeness from Pastor Montell Jordan! Isn't it amazing how God doesn't just want to heal us, but make us completely whole? Using the powerful story of the ten lepers in Luke 17, Pastor Jordan breaks down three incredible insights about healing. Sometimes we have to go THROUGH our challenges, not around them. God sees us - even when we feel distant and forgotten. And most importantly, healing requires movement and action on our part! The most profound moment was when he highlighted that out of ten lepers healed, only one returned to thank Jesus - and THAT is what made him whole. Can you imagine? Physical healing is one thing, but being truly whole is transformative! Pastor Montell shared his own vulnerable journey of healing after infidelity, demonstrating that no matter how broken we are, God can restore and make us completely new. The sermon wasn't just about physical healing, but healing of the heart, mind, and spirit. Whether you're struggling with hidden sin, unforgiveness, or feeling stuck, this message declares that healing is on the way - but you've got to be willing to move and have faith!",
    "tags": [
        "Healing",
        "Wholeness",
        "Restoration"
    ],
    "mainPoints": [
        "Sometimes you have to go through it to get to it",
        "God sees you, even in your most distant moments",
        "Healing requires movement and active faith"
    ],
    "versesMentioned": [
        {
            "verse": "Luke 17:11-19",
            "text": "Now on his way to Jerusalem, Jesus traveled along the border between Samaria and Galilee. As he was going into a village, ten men who had leprosy met him. They stood at a distance and called out in a loud voice, 'Jesus, Master, have pity on us!' When he saw them, he said, 'Go, show yourselves to the priests.' And as they went, they were cleansed. One of them, when he saw he was healed, came back, praising God in a loud voice. He threw himself at Jesus' feet and thanked him—and he was a Samaritan. Jesus asked, 'Were not all ten cleansed? Where are the other nine? Has no one returned to give praise to God except this foreigner?' Then he said to him, 'Rise and go; your faith has made you well.'",
            "version": "NIV"
        },
        {
            "verse": "1 John 1:9",
            "text": "If we confess our sins, he is faithful and just and will forgive us our sins and purify us from all unrighteousness.",
            "version": "NIV"
        },
        {
            "verse": "James 5:16",
            "text": "Therefore confess your sins to each other and pray for each other so that you may be healed. The prayer of a righteous person is powerful and effective.",
            "version": "NIV"
        }
    ],
    "dailyActionPlan": {
        "Monday": {
            "scripture": "Psalm 147:3: 'He heals the brokenhearted and binds up their wounds.'",
            "focus": "Recognizing areas in need of healing",
            "action": "Create a personal inventory of emotional, spiritual, and physical areas where you need God's healing. Be honest and specific, writing down each area without judgment.",
            "prayer": "Lord, reveal to me the places in my heart and life that need Your healing touch. Give me courage to look honestly at my wounds and trust You with my restoration. Amen."
        },
        "Tuesday": {
            "scripture": "Jeremiah 30:17: 'I will restore you to health and heal your wounds, declares the Lord.'",
            "focus": "Understanding God's heart for healing",
            "action": "Research biblical stories of healing. Journal about how these stories demonstrate God's desire to make people whole, not just physically healed.",
            "prayer": "Father, help me understand that Your desire is not just to patch me up, but to make me completely whole. Teach me what true healing looks like. Amen."
        },
        "Wednesday": {
            "scripture": "Isaiah 53:5: 'By his wounds we are healed.'",
            "focus": "Recognizing healing comes through Christ",
            "action": "Identify one area of brokenness and specifically pray, declaring Jesus' healing power over that situation. Consider seeking accountability or counsel if needed.",
            "prayer": "Jesus, I surrender this wounded area to You. Your stripes provide my healing. Fill me with Your strength and restoration. Amen."
        },
        "Thursday": {
            "scripture": "Exodus 15:26: 'I am the Lord, who heals you.'",
            "focus": "Developing a healing mindset",
            "action": "Practice gratitude by listing three ways God has already brought healing in your life. Share one of these stories with someone to encourage them.",
            "prayer": "Lord, thank You for Your healing power. Help me remember Your faithfulness and share Your goodness with others. Amen."
        },
        "Friday": {
            "scripture": "3 John 1:2: 'Dear friend, I pray that you may enjoy good health and that all may go well with you, even as your soul is getting along well.'",
            "focus": "Holistic healing - body, mind, and spirit",
            "action": "Do something intentional for your physical, mental, and spiritual health today. This could mean exercise, meditation, prayer, or spiritual reading.",
            "prayer": "God, heal me completely - body, mind, and spirit. Show me practical steps to honor You in every area of my life. Amen."
        },
        "Saturday": {
            "scripture": "Deuteronomy 30:3: 'The Lord your God will restore your fortunes and have compassion on you and gather you again from all the nations.'",
            "focus": "Restoration and renewed purpose",
            "action": "Reflect on your personal journey of healing. Write a letter to yourself, acknowledging how far God has brought you and expressing hope for continued growth.",
            "prayer": "Heavenly Father, thank You for Your continuous work of healing and restoration in my life. Help me trust Your process and walk in the wholeness You provide. Amen."
        }
    },
    "videoUrl": "https://www.youtube.com/embed/ZNwVVcBu9rY"
}