{
    "summaryText": "Wow, what an incredible Resurrection Sunday message from Pastor Travis Hearn! Delving into the profound significance of 'Yahweh', PT takes us on a powerful journey through God's identity and His transformative power. Drawing from the story of Moses and Jesus' own declarations of 'I AM', the sermon explores how God is not just a distant deity, but a present, life-giving force. Pastor Travis shares his personal testimony of surviving a brain aneurysm and stroke, powerfully illustrating Jesus' ability to reverse the irreversible. Can you imagine being told you should be dead or a vegetable, yet standing whole and healed? That's the God we serve! The sermon brilliantly contrasts the 'bread of death' offered by the enemy with the 'bread of life' Jesus provides. PT challenges us to examine what we're consuming spiritually - are we feeding on death or life? His vivid description of the devil's menu (filled with temptations like drunkenness, cheating, and pride) versus God's life-giving menu is both humorous and profoundly convicting. The most powerful moment? When Pastor Travis declares that God raises dead things back to life - whether it's marriages, health, or spiritual dreams. This isn't just a Easter message, it's a life-transforming revelation of who God is: I AM - the resurrection, the life, the bread that truly satisfies!",
    "tags": [
        "Resurrection",
        "Healing",
        "Faith"
    ],
    "mainPoints": [
        "God is the 'I AM' - present, powerful, and unchanging",
        "Jesus is the Bread of Life who satisfies our deepest spiritual hunger",
        "God can reverse the irreversible and raise dead things back to life"
    ],
    "versesMentioned": [
        {
            "verse": "Exodus 3:14",
            "text": "God said to Moses, 'I AM WHO I AM. This is what you are to say to the Israelites: 'I AM has sent me to you.'",
            "version": "NIV"
        },
        {
            "verse": "John 8:58",
            "text": "'Very truly I tell you,' Jesus answered, 'before Abraham was born, I am!'",
            "version": "NIV"
        },
        {
            "verse": "John 1:1,14",
            "text": "In the beginning was the Word, and the Word was with God, and the Word was God. The Word became flesh and made his dwelling among us.",
            "version": "NIV"
        },
        {
            "verse": "Luke 24:1-6",
            "text": "On the first day of the week, very early in the morning, the women took the spices they had prepared and went to the tomb. They found the stone rolled away from the tomb, but when they entered, they did not find the body of the Lord Jesus. While they were wondering about this, suddenly two men in clothes that gleamed like lightning stood beside them. In their fright the women bowed down with their faces to the ground, but the men said to them, 'Why do you look for the living among the dead? He is not here; he has risen!'",
            "version": "NIV"
        },
        {
            "verse": "John 6:35",
            "text": "Then Jesus declared, 'I am the bread of life. Whoever comes to me will never go hungry, and whoever believes in me will never be thirsty.'",
            "version": "NIV"
        },
        {
            "verse": "John 3:16",
            "text": "For God so loved the world that he gave his one and only Son, that whoever believes in him shall not perish but have eternal life.",
            "version": "NIV"
        },
        {
            "verse": "Romans 10:9",
            "text": "If you declare with your mouth, 'Jesus is Lord,' and believe in your heart that God raised him from the dead, you will be saved.",
            "version": "NIV"
        },
        {
            "verse": "2 Corinthians 11:14",
            "text": "And no wonder, for Satan himself masquerades as an angel of light.",
            "version": "NIV"
        },
        {
            "verse": "Psalm 56:8",
            "text": "Record my misery; list my tears on your scroll - are they not in your record?",
            "version": "NIV"
        }
    ],
    "dailyActionPlan": {
        "Monday": {
            "scripture": "Jeremiah 29:11: 'For I know the plans I have for you,' declares the Lord, 'plans to prosper you and not to harm you, plans to give you hope and a future.'",
            "focus": "Recognizing God's ability to resurrect dead areas of your life",
            "action": "Identify one area in your life that feels 'dead' or hopeless. Write it down and pray specifically about it, asking God to breathe new life into that situation.",
            "prayer": "Lord, I surrender this dead area to You. Just as You raised Lazarus, I believe You can resurrect hope and life where I see only death. Give me faith to trust Your power. Amen."
        },
        "Tuesday": {
            "scripture": "Isaiah 43:19: 'See, I am doing a new thing! Now it springs up; do you not perceive it? I am making a way in the wilderness and streams in the wasteland.'",
            "focus": "Consuming spiritual 'bread of life' instead of 'bread of death'",
            "action": "Audit your daily spiritual intake. Track what media, conversations, and content you consume. Identify one thing you'll replace with something that feeds your spirit.",
            "prayer": "God, show me what I'm truly consuming. Help me choose life-giving nutrients for my soul. Guide me to feed on Your Word and Your presence. Amen."
        },
        "Wednesday": {
            "scripture": "Philippians 4:8: 'Finally, brothers and sisters, whatever is true, whatever is noble, whatever is right, whatever is pure, whatever is lovely, whatever is admirable—if anything is excellent or praiseworthy—think about such things.'",
            "focus": "Choosing life over temptation",
            "action": "Create a visual reminder of God's menu. Write down 3-5 life-giving choices you can make when tempted, and place this where you'll see it daily.",
            "prayer": "Lord, strengthen me to choose Your life over temporary temptations. Give me wisdom to recognize the enemy's tactics and courage to choose Your path. Amen."
        },
        "Thursday": {
            "scripture": "2 Corinthians 10:5: 'We demolish arguments and every pretension that sets itself up against the knowledge of God, and we take captive every thought to make it obedient to Christ.'",
            "focus": "Recognizing and rejecting the enemy's deceptive menu",
            "action": "Practice immediate prayer when a tempting thought enters your mind. Develop a quick mental 'exit strategy' for moments of weakness.",
            "prayer": "Jesus, be my defense against temptation. Help me recognize the enemy's lies and immediately turn my thoughts to You. Fill me with Your strength. Amen."
        },
        "Friday": {
            "scripture": "James 4:7: 'Submit yourselves, then, to God. Resist the devil, and he will flee from you.'",
            "focus": "Standing firm in spiritual identity",
            "action": "Write down your identity in Christ. List 5-10 truths about who you are because of Jesus, and read them aloud as a declaration.",
            "prayer": "Father, remind me of who I am in You. I am not defined by my past or my struggles, but by Your love and purpose. Strengthen my identity in Christ. Amen."
        },
        "Saturday": {
            "scripture": "Romans 12:2: 'Do not conform to the pattern of this world, but be transformed by the renewing of your mind. Then you will be able to test and approve what God's will is—his good, pleasing and perfect will.'",
            "focus": "Continuously choosing life and transformation",
            "action": "Reflect on the week. Journal about moments you chose God's menu over the world's. Celebrate victories and surrender ongoing struggles.",
            "prayer": "Lord, thank You for Your patience and grace. Continue transforming me from the inside out. Help me consistently choose life and walk in Your purpose. Amen."
        }
    },
    "videoUrl": "https://www.youtube.com/embed/vkJDiq6STvY"
}