{
    "summaryText": "Wow, what an eye-opening sermon from Pastor Travis Hearn about the dangers of having a 'purse with holes'! PT dives deep into the biblical concept of tithing and serving God with urgency, challenging us to examine whether we're living for ourselves or truly building God's kingdom. Drawing from the book of Haggai, he exposes the 'not yet' mentality that plagues many Christians - always putting off serving God until 'someday'. Can you imagine how much impact the church could have if everyone committed 100% to God's vision? Pastor Travis breaks down the spiritual principle that where our treasure goes, our heart follows. He's not just talking about money, but about making God the ultimate priority in every aspect of our lives. The message is clear: you can't expect a 'right now' God if you're stuck in a 'not yet' mindset. Whether it's through financial giving, serving in ministry, or dedicating your time and talents, God is calling us to be active participants in building His church. This isn't just another sermon about tithing - it's a radical call to live with purpose, urgency, and total commitment to God's plan.",
    "tags": [
        "Tithing",
        "Obedience",
        "Purpose"
    ],
    "mainPoints": [
        "Recognize if your 'purse has holes' - are you truly prioritizing God?",
        "Move from a 'not yet' mentality to urgent kingdom-building",
        "Understand that tithing is about priority, not just financial transaction"
    ],
    "versesMentioned": [
        {
            "verse": "Haggai 1:2-9",
            "version": "NIV",
            "text": "'These people say, 'The time has not yet come to rebuild the Lord's house.'' Then the word of the Lord came through the prophet Haggai: 'Is it a time for you yourselves to be living in your paneled houses, while this house remains a ruin?' Now this is what the Lord Almighty says: 'Give careful thought to your ways. You have planted much, but harvested little. You eat, but never have enough. You drink, but never have your fill. You put on clothes, but are not warm. You earn wages, only to put them in a purse with holes in it.'"
        },
        {
            "verse": "Deuteronomy 14:23",
            "version": "Living Bible",
            "text": "The purpose of tithing is to teach you always to put God first in your life."
        },
        {
            "verse": "Leviticus 27:30",
            "version": "NIV",
            "text": "A tenth of all you produce is the Lord's, and it is holy."
        },
        {
            "verse": "Malachi 3:10",
            "version": "NIV",
            "text": "'Bring the whole tithe into the storehouse, that there may be food in my house. Test me in this,' says the Lord Almighty, 'and see if I will not throw open the floodgates of heaven and pour out so much blessing that there will not be room enough to store it.'"
        },
        {
            "verse": "Matthew 6:21",
            "version": "NIV",
            "text": "For where your treasure is, there your heart will be also."
        },
        {
            "verse": "John 12:1-8",
            "version": "NIV",
            "text": "Six days before the Passover, Jesus came to Bethany, where Lazarus lived, whom Jesus had raised from the dead. Here a dinner was given in Jesus' honor. Martha served, while Lazarus was among those reclining at the table with him. Then Mary took about a pint of pure nard, an expensive perfume; she poured it on Jesus' feet and wiped his feet with her hair. And the house was filled with the fragrance of the perfume."
        }
    ],
    "dailyActionPlan": {
        "Monday": {
            "scripture": "Proverbs 3:9-10: 'Honor the Lord with your wealth, with the firstfruits of all your produce; then your barns will be filled to overflowing, and your vats will brim over with new wine.'",
            "focus": "Recognizing God's ownership of your resources",
            "action": "List all your current income sources. Pray over each one, acknowledging that they are gifts from God. Reflect on how you can honor God with these resources.",
            "prayer": "Lord, help me see my finances through Your lens. Show me how to be a faithful steward of the resources You've entrusted to me. Guide my heart to prioritize Your kingdom. Amen."
        },
        "Tuesday": {
            "scripture": "Luke 16:10: 'Whoever can be trusted with very little can also be trusted with very much, and whoever is dishonest with very little will also be dishonest with much.'",
            "focus": "Developing faithfulness in small things",
            "action": "Identify one small area where you can practice financial integrity or generosity. This could be donating to a cause, helping a neighbor, or being extra careful with your spending.",
            "prayer": "Father, teach me to be faithful in the small things. Help me develop a heart of generosity and trust in Your provision. Show me where I can give sacrificially today. Amen."
        },
        "Wednesday": {
            "scripture": "2 Corinthians 9:7: 'Each of you should give what you have decided in your heart to give, not reluctantly or under compulsion, for God loves a cheerful giver.'",
            "focus": "Understanding the heart behind giving",
            "action": "Reflect on your current attitude towards giving. Are you giving out of obligation or joy? Journal about your motivations and ask God to transform your perspective.",
            "prayer": "God, examine my heart. Help me give not out of duty, but out of love and gratitude for all You've done. Make me a cheerful giver who delights in supporting Your kingdom. Amen."
        },
        "Thursday": {
            "scripture": "Malachi 3:10: 'Bring the whole tithe into the storehouse, that there may be food in my house. Test me in this,' says the Lord Almighty, 'and see if I will not throw open the floodgates of heaven and pour out so much blessing that there will not be room enough to store it.'",
            "focus": "Trusting God's promises of provision",
            "action": "Research local ministries or church initiatives you feel passionate about. Consider how you might support them financially or through volunteering.",
            "prayer": "Lord, I want to trust You completely. Give me faith to step out in generosity, believing in Your promises of provision. Show me how I can invest in Your kingdom today. Amen."
        },
        "Friday": {
            "scripture": "Acts 20:35: 'In everything I did, I showed you that by this kind of hard work we must help the weak, remembering the words the Lord Jesus himself said: 'It is more blessed to give than to receive.''",
            "focus": "Experiencing the joy of sacrificial giving",
            "action": "Look for an unexpected opportunity to give today - whether it's money, time, or resources. Do something completely unexpected and sacrificial for someone else.",
            "prayer": "Father, make me sensitive to the needs around me. Help me see opportunities to give generously and experience the joy of serving others. Use me as Your instrument of blessing today. Amen."
        },
        "Saturday": {
            "scripture": "Philippians 4:19: 'And my God will meet all your needs according to the riches of his glory in Christ Jesus.'",
            "focus": "Trusting God's complete provision",
            "action": "Review your financial goals and commitments. Pray over each one, surrendering your plans to God and asking for His wisdom and guidance.",
            "prayer": "Lord, I trust in Your provision. Help me to be wise with my resources, to give generously, and to rely on Your unlimited supply. Guide my financial decisions and help me honor You in all things. Amen."
        }
    },
    "videoUrl": "https://www.youtube.com/embed/AZYqU6WW0XI"
}