{
    "summaryText": "In this powerful sermon, Pastor Travis Hearn takes us on an incredible journey through healing and hope, using the biblical story of two desperate people - a synagogue leader and a woman with a chronic illness. Can you imagine being so desperate for a breakthrough that you're willing to push through crowds, break social norms, and reach out deliberately for Jesus? That's exactly what these characters did! Pastor Travis emphasizes that our breakthrough is often just one deliberate touch away from Jesus. He powerfully illustrates how suffering can be constant, but God's healing is immediate. 'Throw away the crutches,' he challenges us, revealing that our real power isn't in our circumstances, but in God's presence. Isn't it amazing how God can transform our deepest pain into our most powerful testimony? The sermon is a rallying cry to stop being indifferent and start being deliberate about seeking God. Whether you're dealing with a 12-year struggle or feeling spiritually dead, Pastor Travis declares that your life is about to return! Hell isn't ready for the new you that's about to be resurrected!",
    "tags": [
        "Healing",
        "Faith",
        "Hope"
    ],
    "mainPoints": [
        "Find power in God's presence",
        "Be deliberate in seeking Jesus",
        "Your breakthrough is just one touch away"
    ],
    "versesMentioned": [
        {
            "verse": "Luke 8:41-55",
            "text": "Narrative of Jairus's daughter and the woman with the blood disease",
            "version": "NIV"
        },
        {
            "verse": "John 10:10",
            "text": "The thief comes only to steal and kill and destroy; I have come that they may have life, and have it to the full.",
            "version": "NIV"
        },
        {
            "verse": "Acts 1:4-5",
            "text": "Do not leave Jerusalem, but wait for the gift my Father promised, which you have heard me speak about. For John baptized with water, but in a few days you will be baptized with the Holy Spirit.",
            "version": "NIV"
        },
        {
            "verse": "Acts 1:8",
            "text": "But you will receive power when the Holy Spirit comes on you; and you will be my witnesses in Jerusalem, and in all Judea and Samaria, and to the ends of the earth.",
            "version": "NIV"
        },
        {
            "verse": "Acts 2:1-4",
            "text": "When the day of Pentecost came, they were all together in one place. Suddenly a sound like the blowing of a violent wind came from heaven and filled the whole house where they were sitting. They saw what seemed to be tongues of fire that separated and came to rest on each of them. All of them were filled with the Holy Spirit and began to speak in other tongues as the Spirit enabled them.",
            "version": "NIV"
        },
        {
            "verse": "Ephesians 6:16",
            "text": "In addition to all this, take up the shield of faith, with which you can extinguish all the flaming arrows of the evil one.",
            "version": "NIV"
        },
        {
            "verse": "Psalm 16:11",
            "text": "You make known to me the path of life; you will fill me with joy in your presence, with eternal pleasures at your right hand.",
            "version": "NIV"
        }
    ],
    "dailyActionPlan": {
        "Monday": {
            "scripture": "Psalm 34:18: 'The Lord is close to the brokenhearted and saves those who are crushed in spirit.'",
            "focus": "Recognizing God's presence in our brokenness",
            "action": "Write down an area of your life where you feel broken or desperate. Commit to deliberately seeking God's presence in that specific area.",
            "prayer": "Lord, I bring my brokenness to You. Show me how to be deliberate in seeking Your presence and healing. Help me trust that You are near, even when I feel furthest from You. Amen."
        },
        "Tuesday": {
            "scripture": "James 4:8: 'Come near to God and he will come near to you.'",
            "focus": "Intentional pursuit of God's presence",
            "action": "Set aside 15 uninterrupted minutes to worship and pray. Remove all distractions and focus solely on connecting with God.",
            "prayer": "Heavenly Father, I want to be deliberate in seeking You. Help me quiet my mind and open my heart to Your presence. Draw near to me as I draw near to You. Amen."
        },
        "Wednesday": {
            "scripture": "Jeremiah 29:13: 'You will seek me and find me when you seek me with all your heart.'",
            "focus": "Wholehearted pursuit of God",
            "action": "Identify one 'crutch' in your life that you've been relying on instead of God. Take practical steps to release it.",
            "prayer": "God, reveal the crutches I've been using to avoid fully depending on You. Give me courage to let them go and trust completely in Your power. Amen."
        },
        "Thursday": {
            "scripture": "Psalm 46:10: 'Be still, and know that I am God.'",
            "focus": "Listening and waiting in God's presence",
            "action": "Practice silent meditation. Sit quietly and listen for God's voice, without filling the space with your own thoughts or prayers.",
            "prayer": "Lord, teach me to be still. Help me quiet my mind and truly listen. Speak to my heart in ways beyond words. Amen."
        },
        "Friday": {
            "scripture": "2 Corinthians 12:9: 'My grace is sufficient for you, for my power is made perfect in weakness.'",
            "focus": "Finding strength in vulnerability",
            "action": "Share a current struggle with a trusted friend or mentor. Allow yourself to be vulnerable and seek prayer support.",
            "prayer": "Father, help me embrace my weakness and trust in Your strength. Give me courage to be authentic and seek support. Remind me that Your grace is enough. Amen."
        },
        "Saturday": {
            "scripture": "Philippians 3:13-14: 'But one thing I do: Forgetting what is behind and straining toward what is ahead, I press on toward the goal to win the prize for which God has called me heavenward in Christ Jesus.'",
            "focus": "Moving forward with purpose",
            "action": "Create a list of dreams and goals. Pray over each one, surrendering them to God and asking for His guidance and power.",
            "prayer": "Lord, I surrender my plans and dreams to You. Give me Your vision, Your purpose. Help me press forward with hope and faith, trusting in Your leading. Amen."
        }
    },
    "videoUrl": "https://www.youtube.com/embed/WbDq8NaTNEU"
}