{
    "summaryText": "What a powerful message about stewardship and generosity! Pastor Travis Hearn delivers an eye-opening sermon about our relationship with money and God, challenging us to see our resources differently. Can you believe that 80% of humanity lives on less than $10 a day? PT breaks down the concept of affluence, helping us understand that being 'rich' isn't just about having lots of money, but about how we use what God has entrusted to us. Through compelling stories about Impact Church's mission work in Nicaragua, where just $1,500 can build an entire house, he reminds us that we are incredibly blessed. The sermon centers around three critical questions: Can God trust me? Will I sacrifice to help build God's church? Will I put God first? Pastor Travis challenges the 'consumer Christianity' mindset, urging us to move from being takers to being givers. The most profound moment? When he reveals that Jesus taught more about money and possessions than any other topic! This isn't just a sermon about tithing; it's a radical call to reimagine our relationship with resources, seeing them as tools for Kingdom advancement rather than personal comfort.",
    "tags": [
        "Tithing",
        "Stewardship",
        "Generosity"
    ],
    "mainPoints": [
        "Can God trust me with the resources He has given me?",
        "Am I willing to sacrifice to help build God's church?",
        "Is God truly first in my financial decisions?"
    ],
    "versesMentioned": [
        {
            "verse": "Luke 16:10-13",
            "text": "Whoever can be trusted with very little can also be trusted with very much, and whoever is dishonest with very little will also be dishonest with much. So if you have not been trustworthy in handling worldly wealth, who will trust you with true riches? And if you have not been trustworthy with someone else's property, who will give you property of your own? No one can serve two masters. Either you will hate the one and love the other, or you will be devoted to the one and despise the other. You cannot serve both God and money.",
            "version": "NIV"
        },
        {
            "verse": "Psalm 24:1",
            "text": "The earth is the Lord's, and everything in it, the world, and all who live in it.",
            "version": "NIV"
        },
        {
            "verse": "1 Timothy 6:17-19",
            "text": "Command those who are rich in this present world not to be arrogant nor to put their hope in wealth, which is so uncertain, but to put their hope in God, who richly provides us with everything for our enjoyment. Command them to do good, to be rich in good deeds, and to be generous and willing to share. In this way they will lay up treasure for themselves as a firm foundation for the coming age, so that they may take hold of the life that is truly life.",
            "version": "NIV"
        },
        {
            "verse": "Deuteronomy 14:23",
            "text": "The purpose of tithing is to teach you always to put God first in your lives.",
            "version": "TLB"
        },
        {
            "verse": "Proverbs 3:9-10",
            "text": "Honor the Lord with your wealth, with the firstfruits of all your crops; then your barns will be filled to overflowing, and your vats will brim over with new wine.",
            "version": "NIV"
        },
        {
            "verse": "Malachi 3:10",
            "text": "Bring the whole tithe into the storehouse, that there may be food in my house. Test me in this,' says the Lord Almighty, 'and see if I will not throw open the floodgates of heaven and pour out so much blessing that there will not be room enough to store it.'",
            "version": "NIV"
        },
        {
            "verse": "Luke 12:16-21",
            "text": "And he told them this parable: 'The ground of a certain rich man yielded an abundant harvest. He thought to himself, 'What shall I do? I have no place to store my crops.' Then he said, 'This is what I'll do. I will tear down my barns and build bigger ones, and there I will store my surplus grain. And I'll say to myself, 'You have plenty of grain laid up for many years. Take life easy; eat, drink and be merry.' But God said to him, 'You fool! This very night your life will be demanded from you. Then who will get what you have prepared for yourself?' This is how it will be with whoever stores up things for themselves but is not rich toward God.'",
            "version": "NIV"
        }
    ],
    "dailyActionPlan": {
        "Monday": {
            "scripture": "Matthew 6:21: 'For where your treasure is, there your heart will be also.'",
            "focus": "Understanding where my true treasure lies",
            "action": "Review your bank and credit card statements from the past month. Categorize your spending and reflect on what your spending reveals about your priorities. Are you investing more in temporary things or eternal purposes?",
            "prayer": "Lord, reveal my heart's true priorities. Help me align my resources with Your kingdom purposes and see my finances as a tool for Your glory. Guide me to be a faithful steward. Amen."
        },
        "Tuesday": {
            "scripture": "2 Corinthians 9:7: 'Each of you should give what you have decided in your heart to give, not reluctantly or under compulsion, for God loves a cheerful giver.'",
            "focus": "Developing a joyful giving mentality",
            "action": "Set aside a specific amount this week to give - whether to your church, a missionary, or a charitable organization. Give with joy, not out of obligation.",
            "prayer": "Father, transform my heart's attitude toward giving. Help me see generosity as a privilege, not a burden. Teach me to give cheerfully and abundantly. Amen."
        },
        "Wednesday": {
            "scripture": "Proverbs 11:25: 'A generous person will prosper; whoever refreshes others will themselves be refreshed.'",
            "focus": "Understanding generosity as a spiritual discipline",
            "action": "Look for an unexpected opportunity to be generous today - this could be financial, but also with your time, skills, or encouragement.",
            "prayer": "God, open my eyes to opportunities to be generous. Help me see people through Your eyes and respond with love and kindness. Make me a conduit of Your blessing. Amen."
        },
        "Thursday": {
            "scripture": "Luke 12:34: 'For where your treasure is, there your heart will be also.'",
            "focus": "Aligning heart and resources",
            "action": "Create a simple budget that intentionally includes giving. Identify one area where you can reduce personal spending to increase Kingdom-focused giving.",
            "prayer": "Lord, help me be intentional with the resources You've entrusted to me. Show me how to steward my finances in a way that honors You and advances Your kingdom. Amen."
        },
        "Friday": {
            "scripture": "Malachi 3:10: 'Bring the whole tithe into the storehouse... Test me in this, says the Lord Almighty.'",
            "focus": "Trusting God's promise of provision",
            "action": "If you haven't already, commit to trying the 90-day tithe challenge. Start setting aside 10% of your income and trust God's promise of blessing.",
            "prayer": "Father, I trust Your promise. Give me courage to step out in faith and test Your faithfulness in my finances. Help me trust You more than my own understanding. Amen."
        },
        "Saturday": {
            "scripture": "Philippians 4:19: 'And my God will meet all your needs according to the riches of his glory in Christ Jesus.'",
            "focus": "Experiencing God's supernatural provision",
            "action": "Reflect on God's faithfulness in your life. Journal about times He has provided, protected, or surprised you with His generosity.",
            "prayer": "Lord, thank You for Your endless generosity. Help me live with an attitude of gratitude and trust in Your continuous provision. Remind me that everything I have comes from You. Amen."
        }
    },
    "videoUrl": "https://www.youtube.com/embed/qGsK6cfVnAo"
}