{
    "summaryText": "Today we had a guest speaker James Braxton Powell deliver a powerful sermon about discovering and pouring out your God-given potential! Drawing from the story of the widow with the oil in 2 Kings 4, Powell passionately unpacked how God can multiply even the smallest resources when we're obedient. The central message was about trusting God with what little you have and watching Him do extraordinary things. Powell shared his own journey from homelessness and multiple suicide attempts to becoming a voice of hope, demonstrating that God can transform our most broken moments into miraculous assignments. The sermon challenged listeners to stop overlooking their 'oil' - those unique gifts, talents, and experiences God has placed within them. He emphasized that your calling isn't about waiting for the perfect moment, but about being faithful with what you currently have. The most powerful takeaway? God is looking for vessels willing to be poured out, not just filled up. Powell's raw, authentic storytelling and biblical insights reminded us that when we surrender our little to God, He can do exceedingly, abundantly more than we could ever imagine.",
    "tags": [
        "Purpose",
        "Faith",
        "Obedience"
    ],
    "mainPoints": [
        "God can multiply your small resources when you're willing to be obedient",
        "Your current limitations do not determine your potential",
        "Pouring out what God has given you creates space for miraculous multiplication"
    ],
    "versesMentioned": [
        {
            "verse": "2 Kings 4:1-7",
            "text": "The story of the widow and her oil, demonstrating God's ability to multiply resources through obedience",
            "version": "NIV"
        },
        {
            "verse": "Romans 5:3-4",
            "text": "Not only so, but we also glory in our sufferings, because we know that suffering produces perseverance; perseverance, character; and character, hope.",
            "version": "NIV"
        },
        {
            "verse": "Ephesians 2:10",
            "text": "For we are God's handiwork, created in Christ Jesus to do good works, which God prepared in advance for us to do.",
            "version": "NIV"
        },
        {
            "verse": "Romans 10:9",
            "text": "If you declare with your mouth, 'Jesus is Lord,' and believe in your heart that God raised him from the dead, you will be saved.",
            "version": "NIV"
        },
        {
            "verse": "Ephesians 3:20",
            "text": "Now to him who is able to do immeasurably more than all we ask or imagine, according to his power that is at work within us.",
            "version": "NIV"
        }
    ],
    "dailyActionPlan": {
        "Monday": {
            "scripture": "Jeremiah 29:11: 'For I know the plans I have for you,' declares the Lord, 'plans to prosper you and not to harm you, plans to give you hope and a future.'",
            "focus": "Recognizing God's intentional plan for your life",
            "action": "Make a list of 3 unique gifts or experiences you have that might seem insignificant. Pray and ask God how He might want to use them for His purpose.",
            "prayer": "Lord, help me see the potential in what I consider small. Reveal to me how You can use my unique experiences and gifts for Your glory. Open my eyes to opportunities I might be overlooking. Amen."
        },
        "Tuesday": {
            "scripture": "1 Corinthians 1:27: 'But God chose the foolish things of the world to shame the wise; God chose the weak things of the world to shame the strong.'",
            "focus": "Understanding that God uses the unlikely",
            "action": "Identify one area in your life where you feel inadequate. Journal about how God might want to use that very weakness as a strength.",
            "prayer": "Heavenly Father, transform my perspective on my limitations. Help me see that what I consider weak, You can use powerfully. Give me courage to surrender my inadequacies to You. Amen."
        },
        "Wednesday": {
            "scripture": "Zechariah 4:10: 'Do not despise these small beginnings, for the Lord rejoices to see the work begin.'",
            "focus": "Embracing small starts and incremental progress",
            "action": "Take one small step towards a dream or calling you've been hesitating to pursue. Write down what that step looks like and commit it to prayer.",
            "prayer": "God, give me the faith to start small. Help me not to be overwhelmed by the magnitude of the vision, but to be faithful in the little things. Guide my first steps. Amen."
        },
        "Thursday": {
            "scripture": "Philippians 4:13: 'I can do all this through him who gives me strength.'",
            "focus": "Trusting in God's empowerment",
            "action": "List 5 things you've been afraid to attempt, believing you're not capable. Beside each, write a declaration of faith about God's ability through you.",
            "prayer": "Lord, replace my fear with faith. Help me see myself through Your eyes - as capable, empowered, and called. Give me courage to step into the assignments You've prepared. Amen."
        },
        "Friday": {
            "scripture": "Isaiah 43:19: 'See, I am doing a new thing! Now it springs up; do you not perceive it? I am making a way in the wilderness and streams in the wasteland.'",
            "focus": "Anticipating God's fresh movement in your life",
            "action": "Spend time in quiet reflection. Ask God to reveal any areas where He wants to do something new. Be open and listen.",
            "prayer": "Gracious God, I am open to Your new work in my life. Reveal to me the paths You are creating. Give me spiritual eyes to see Your movement and ears to hear Your guidance. Amen."
        },
        "Saturday": {
            "scripture": "Proverbs 16:9: 'In their hearts humans plan their course, but the Lord establishes their steps.'",
            "focus": "Surrendering plans to God's greater purpose",
            "action": "Review your current goals and dreams. Surrender each one to God, asking Him to align your desires with His purpose.",
            "prayer": "Father, I surrender my plans and dreams to You. Align my heart with Your perfect will. Help me to trust Your guidance and timing. Make me willing to be used by You in whatever way You choose. Amen."
        }
    },
    "videoUrl": "https://www.youtube.com/embed/Zd5hUx0VRs0"
}