{
    "summaryText": "Wow, what a powerful message about total surrender from Pastor Travis Hearn! PT delivered an incredible sermon about being a 'conditional use Christian' versus an all-in, no-strings-attached follower of Jesus. He challenges us to ask ourselves: Are we really willing to say 'yes' to God without limitations? The sermon dives deep into what it truly means to follow Christ - it's not about joining a comfortable club, but about being willing to go wherever God calls you. Pastor Travis shares his own spiritual journey, revealing how 31 years ago he prayed a dangerous prayer: 'God, use me however, whenever, wherever.' He candidly shares that this prayer led him through incredible mountaintops and devastating valleys, but ultimately transformed his life. The most powerful moment? When he reveals that most Christians want Jesus to follow them, instead of them following Jesus. This sermon is a wake-up call to stop playing church and start being a true disciple - someone who says 'yes' to God before He even asks the question!",
    "tags": [
        "Obedience",
        "Purpose",
        "Surrender"
    ],
    "mainPoints": [
        "God is looking for unconditional followers, not conditional Christians",
        "Your 'yes' to God might look very different from what you expect",
        "True discipleship costs everything and requires complete surrender"
    ],
    "versesMentioned": [
        {
            "verse": "Isaiah 6:8",
            "text": "Then I heard the voice of the Lord saying, 'Whom shall I send? And who will go for us?' And I said, 'Here am I. Send me!'",
            "version": "NIV"
        },
        {
            "verse": "Acts 11:26",
            "text": "...and the disciples were first called Christians at Antioch.",
            "version": "NIV"
        },
        {
            "verse": "Romans 10:9",
            "text": "If you declare with your mouth, 'Jesus is Lord,' and believe in your heart that God raised him from the dead, you will be saved.",
            "version": "NIV"
        },
        {
            "verse": "Luke 9:57-62",
            "text": "As they were walking along the road, a man said to him, 'I will follow you wherever you go.' Jesus replied, 'Foxes have dens and birds have nests, but the Son of Man has no place to lay his head.' He said to another man, 'Follow me.' But he replied, 'Lord, first let me go and bury my father.' Jesus said to him, 'Let the dead bury their own dead, but you go and proclaim the kingdom of God.' Still another said, 'I will follow you, Lord; but first let me go back and say goodbye to my family.' Jesus replied, 'No one who puts a hand to the plow and looks back is fit for service in the kingdom of God.'",
            "version": "NIV"
        }
    ],
    "dailyActionPlan": {
        "Monday": {
            "scripture": "Jeremiah 29:11: 'For I know the plans I have for you,' declares the Lord, 'plans to prosper you and not to harm you, plans to give you hope and a future.'",
            "focus": "Understanding God's unconditional calling",
            "action": "Write down areas in your life where you've placed conditions on your surrender to God. Reflect on what might be holding you back from a full 'yes'.",
            "prayer": "Lord, reveal the limitations I've placed on my surrender. Give me the courage to say 'yes' to You completely, without conditions. Amen."
        },
        "Tuesday": {
            "scripture": "Philippians 3:7-8: 'But whatever were gains to me I now consider loss for the sake of Christ. What is more, I consider everything a loss because of the surpassing worth of knowing Christ Jesus my Lord.'",
            "focus": "Counting the cost of true discipleship",
            "action": "Make a list of things you're afraid to give up for God. Pray over each item, asking God for the strength to surrender.",
            "prayer": "God, help me value relationship with You more than any earthly comfort or possession. Make me willing to lose everything to gain You. Amen."
        },
        "Wednesday": {
            "scripture": "Matthew 16:24: 'Then Jesus said to his disciples, 'Whoever wants to be my disciple must deny themselves and take up their cross and follow me.'",
            "focus": "Understanding what true discipleship looks like",
            "action": "Identify one area of your life where you've been holding back from full obedience. Take a tangible step towards surrendering that area to God.",
            "prayer": "Jesus, I want to follow You completely. Show me where I'm resisting Your call and give me courage to obey. Amen."
        },
        "Thursday": {
            "scripture": "Isaiah 6:8: 'Then I heard the voice of the Lord saying, 'Whom shall I send? And who will go for us?' And I said, 'Here am I. Send me!'",
            "focus": "Being available for God's assignment",
            "action": "Spend time in prayer asking God, 'What assignment do You have for me right now?' Be still and listen.",
            "prayer": "Lord, I'm available. Use me however You want. My answer is 'yes' before You even ask the question. Amen."
        },
        "Friday": {
            "scripture": "Romans 12:1: 'Therefore, I urge you, brothers and sisters, in view of God's mercy, to offer your bodies as a living sacrifice, holy and pleasing to God—this is your true and proper worship.'",
            "focus": "Living as a living sacrifice",
            "action": "Do something unexpected and sacrificial for someone else today, without expecting anything in return.",
            "prayer": "God, teach me what it means to live as a true sacrifice. Help me lay down my own desires and serve others as an act of worship. Amen."
        },
        "Saturday": {
            "scripture": "Psalm 86:12: 'I will praise you, Lord my God, with all my heart; I will glorify your name forever.'",
            "focus": "Celebrating unconditional surrender",
            "action": "Spend time worshipping God, reflecting on His faithfulness. Journal about moments when God has been faithful even when you were uncertain.",
            "prayer": "Lord, thank You for Your amazing grace. I celebrate Your goodness and commit myself fully to Your purposes. Use me completely. Amen."
        }
    },
    "videoUrl": "https://www.youtube.com/embed/D8hxeYXIoCI"
}