{
    "summaryText": "Wow, what a powerful message from Pastor Travis Hearn about being 'stir crazy' for God! PT delivered an electrifying sermon about how Jesus enters our lives and completely disrupts our comfortable status quo. Using the triumphal entry as his backdrop, he reminded us that when Jesus shows up, everything gets stirred up! Just like an eagle stirs its nest to teach its young to fly, God sometimes creates discomfort in our lives to push us toward our destiny. Pastor Travis shared his own powerful testimony of getting radically saved after a DUI arrest, demonstrating how God can transform our lives in an instant. The most compelling part? His declaration that Impact Church exists 'so that more people will go to heaven when they die and less people will go through hell while they live.' Can you imagine the impact if we all embraced that mission? PT challenged us to get 'stir crazy' - not just for ourselves, but for the lost, the poor, and those desperately needing salvation. His passionate call to bring everyone we know to Resurrection Sunday was both a challenge and an invitation to participate in God's transformative work.",
    "tags": [
        "Salvation",
        "Purpose",
        "Revival"
    ],
    "mainPoints": [
        "When Jesus enters your life, He stirs everything up",
        "God creates discomfort to help us grow and fulfill our purpose",
        "We are called to be 'stir crazy' for salvation"
    ],
    "versesMentioned": [
        {
            "verse": "Matthew 21:1-11",
            "text": "As they approached Jerusalem and came to Bethphage on the Mount of Olives, Jesus sent two disciples, saying to them, 'Go to the village ahead of you, and at once you will find a donkey tied there, with her colt by her. Untie them and bring them to me.'",
            "version": "NIV"
        },
        {
            "verse": "Zechariah 9:9",
            "text": "Rejoice greatly, Daughter Zion! Shout, Daughter Jerusalem! See, your king comes to you, righteous and victorious, lowly and riding on a donkey, on a colt, the foal of a donkey.",
            "version": "NIV"
        },
        {
            "verse": "Judges 13:25",
            "text": "And the Spirit of the Lord began to stir him in Mahaneh Dan, between Zorah and Eshtaol.",
            "version": "NIV"
        },
        {
            "verse": "Deuteronomy 32:11",
            "text": "Like an eagle that stirs up its nest and hovers over its young, that spreads its wings to catch them and carries them aloft.",
            "version": "NIV"
        },
        {
            "verse": "Matthew 23:27",
            "text": "Woe to you, teachers of the law and Pharisees, you hypocrites! You are like whitewashed tombs, which look beautiful on the outside but on the inside are full of the bones of the dead and everything unclean.",
            "version": "NIV"
        },
        {
            "verse": "Romans 10:9",
            "text": "If you declare with your mouth, 'Jesus is Lord,' and believe in your heart that God raised him from the dead, you will be saved.",
            "version": "NIV"
        },
        {
            "verse": "John 5:4",
            "text": "From time to time an angel of the Lord would come down and stir up the waters. The first one into the pool after each such disturbance would be cured of whatever disease they had.",
            "version": "NIV"
        },
        {
            "verse": "Philippians 2:8",
            "text": "And being found in appearance as a man, he humbled himself by becoming obedient to death—even death on a cross!",
            "version": "NIV"
        },
        {
            "verse": "Romans 1:16",
            "text": "For I am not ashamed of the gospel, because it is the power of God that brings salvation to everyone who believes: first to the Jew, then to the Gentile.",
            "version": "NIV"
        }
    ],
    "dailyActionPlan": {
        "Monday": {
            "scripture": "Psalm 51:10: 'Create in me a pure heart, O God, and renew a steadfast spirit within me.'",
            "focus": "Allowing God to stir up areas of spiritual complacency",
            "action": "Make a list of 3 areas in your life where you've become spiritually comfortable. Pray over each area and ask God to create movement and growth.",
            "prayer": "Lord, stir my heart and reveal where I've become stagnant. Give me a hunger for Your presence and a willingness to be uncomfortable for Your purpose. Amen."
        },
        "Tuesday": {
            "scripture": "Isaiah 64:8: 'Yet you, Lord, are our Father. We are the clay, you are the potter; we are all the work of your hand.'",
            "focus": "Embracing God's transformative process",
            "action": "Journal about a time God radically changed your direction. Reflect on how temporary discomfort led to long-term growth.",
            "prayer": "Father, thank You for not leaving me as I am. Mold me, shape me, and help me trust Your refining process. Give me courage to embrace change. Amen."
        },
        "Wednesday": {
            "scripture": "Jeremiah 29:11: 'For I know the plans I have for you,' declares the Lord, 'plans to prosper you and not to harm you, plans to give you hope and a future.'",
            "focus": "Understanding God's intentional stirring",
            "action": "Identify one area of your life where you feel stuck. Ask God to show you how He might be preparing you for something greater.",
            "prayer": "God, help me see beyond my current circumstances. Give me spiritual eyes to recognize Your transformative work in my life. Amen."
        },
        "Thursday": {
            "scripture": "Ephesians 3:20: 'Now to him who is able to do immeasurably more than all we ask or imagine, according to his power that is at work within us.'",
            "focus": "Believing in God's capacity to do extraordinary things",
            "action": "Share your testimony or a story of God's breakthrough with someone who needs encouragement.",
            "prayer": "Lord, use my life as a testimony of Your power. Help me be bold in sharing how You've transformed me. Amen."
        },
        "Friday": {
            "scripture": "Romans 12:2: 'Do not conform to the pattern of this world, but be transformed by the renewing of your mind.'",
            "focus": "Resisting spiritual stagnation",
            "action": "Evaluate your daily habits. Remove one thing that hinders spiritual growth and replace it with a spiritual discipline.",
            "prayer": "God, reveal areas where I've become comfortable. Give me courage to step out of my comfort zone and into Your calling. Amen."
        },
        "Saturday": {
            "scripture": "Psalm 42:1: 'As the deer pants for streams of water, so my soul pants for you, my God.'",
            "focus": "Cultivating spiritual hunger",
            "action": "Set aside extended time for prayer and worship. Ask God to renew your passion and stir your heart for His purpose.",
            "prayer": "Father, create in me a desperate hunger for Your presence. Stir my heart and align my desires with Your will. Make me 'stir crazy' for Your Kingdom. Amen."
        }
    },
    "videoUrl": "https://www.youtube.com/embed/mPdO7wIFJ-g"
}