{
    "summaryText": "Wow, what an incredible New Year's Eve sermon from Pastor Lee McFarland! He delivered a powerful message about trusting and obeying God in 2024, using an amazing personal story about leaving his lucrative Microsoft career to follow God's calling. Pastor Lee shared how sometimes God's plan doesn't make logical sense, but when we trust and obey, incredible miracles can happen. Using the story of Naaman from 2 Kings, he illustrated how small acts of obedience can lead to massive blessings. Can you imagine walking away from a $1.3 million opportunity because God was calling you somewhere else? That's radical faith! The sermon wasn't just about making resolutions, but about positioning ourselves to hear and follow God's voice. Pastor Lee challenged us to resist getting angry when God doesn't follow our plans, to pray for discernment, and to expect God to do more than we could ever imagine. His personal testimony of launching a church that grew to 6,000 people in 10 years is a testament to what happens when we step out in faith. The key takeaway? Trust and obey - God's got you in the palm of His hand!",
    "tags": [
        "Obedience",
        "Faith",
        "Purpose"
    ],
    "mainPoints": [
        "Trust that Jesus has the answer you need",
        "Pray for discernment to know when it's not God's voice",
        "Obey God's voice even when it doesn't make logical sense"
    ],
    "versesMentioned": [
        {
            "verse": "Deuteronomy 28:2",
            "text": "All these blessings shall come upon you and overtake you if you obey the voice of the Lord your God.",
            "version": "NIV"
        },
        {
            "verse": "Isaiah 30:21",
            "text": "Whether you turn to the right or to the left, your ears will hear a voice behind you, saying, 'This is the way; walk in it.'",
            "version": "NIV"
        },
        {
            "verse": "Psalm 146:3",
            "text": "Do not put your trust in princes, in human beings, who cannot save.",
            "version": "NIV"
        },
        {
            "verse": "Deuteronomy 14:23",
            "text": "The purpose of tithing is to teach you always to put God first in your lives.",
            "version": "TLB"
        }
    ],
    "dailyActionPlan": {
        "Monday": {
            "scripture": "Proverbs 3:5-6: 'Trust in the Lord with all your heart and lean not on your own understanding; in all your ways submit to him, and he will make your paths straight.'",
            "focus": "Surrendering personal plans to God's guidance",
            "action": "Make a list of your current plans and dreams. Spend time in prayer, asking God to align your desires with His purpose. Be willing to cross out or modify plans that don't align with God's will.",
            "prayer": "Lord, help me to trust You completely. Show me where I'm holding onto my own plans and grant me the courage to surrender them to Your perfect plan. Guide my steps today. Amen."
        },
        "Tuesday": {
            "scripture": "James 1:5: 'If any of you lacks wisdom, you should ask God, who gives generously to all without finding fault, and it will be given to you.'",
            "focus": "Developing spiritual discernment",
            "action": "Practice listening prayer. Spend 10-15 minutes in silence, asking God to speak to you. Write down any impressions or thoughts that come to mind, and test them against Scripture.",
            "prayer": "Heavenly Father, give me a discerning heart. Help me to recognize Your voice and distinguish it from other influences. Grant me wisdom and clarity today. Amen."
        },
        "Wednesday": {
            "scripture": "Romans 12:2: 'Do not conform to the pattern of this world, but be transformed by the renewing of your mind. Then you will be able to test and approve what God's will is—his good, pleasing and perfect will.'",
            "focus": "Renewing our minds to understand God's will",
            "action": "Identify one area of your life where you're struggling to obey God. Create a specific plan to align your thoughts and actions with biblical principles in that area.",
            "prayer": "Lord, transform my thinking. Where I've been stuck in worldly patterns, give me Your perspective. Renew my mind and help me walk in Your ways. Amen."
        },
        "Thursday": {
            "scripture": "Isaiah 41:10: 'So do not fear, for I am with you; do not be dismayed, for I am your God. I will strengthen you and help you; I will uphold you with my righteous right hand.'",
            "focus": "Overcoming fear of the unknown",
            "action": "Make a list of your current fears about the future. Beside each fear, write a corresponding promise from Scripture that counters that fear.",
            "prayer": "God of peace, replace my fears with faith. Where I'm anxious about the unknown, remind me that You are always with me. Fill me with Your courage and trust. Amen."
        },
        "Friday": {
            "scripture": "Philippians 4:6-7: 'Do not be anxious about anything, but in every situation, by prayer and petition, with thanksgiving, present your requests to God. And the peace of God, which transcends all understanding, will guard your hearts and your minds in Christ Jesus.'",
            "focus": "Practicing radical trust through prayer",
            "action": "Set aside dedicated prayer time. Instead of focusing on your needs, spend time praising God and thanking Him for His faithfulness. Practice surrendering your plans to Him.",
            "prayer": "Loving Father, teach me to trust You completely. Help me to bring my requests to You with a heart of thanksgiving, believing that Your peace will guard my heart. Amen."
        },
        "Saturday": {
            "scripture": "Jeremiah 29:11: ''For I know the plans I have for you,' declares the Lord, 'plans to prosper you and not to harm you, plans to give you hope and a future.''",
            "focus": "Embracing God's promises for your future",
            "action": "Reflect on your spiritual journey from last year. Journal about ways God was faithful, even in unexpected ways. Pray about your hopes and dreams for the coming year, holding them openly before God.",
            "prayer": "Lord, I trust Your plans for my life. Where I am tempted to worry or control my path, help me to rest in Your sovereign goodness. Guide me into Your perfect will this year. Amen."
        }
    },
    "videoUrl": "https://www.youtube.com/embed/GMV9wffSgts"
}