{
    "summaryText": "Wow, what a powerful sermon about love and selflessness from Pastor Travis Hearn! In today's message, PT breaks down what true love really looks like - and spoiler alert, it's not about us! Can you imagine a world where everyone prioritized others before themselves? Pastor Travis digs deep into 1 Corinthians 13, revealing that love is fundamentally about surrender, service, and sacrifice. He challenges us to move beyond our narcissistic, self-absorbed nature and embrace a Christ-like selflessness. Using powerful illustrations like Mary's extravagant act of pouring expensive perfume on Jesus' feet versus Judas' selfish critique, PT shows us the difference between givers and takers. The most profound moment? When he reminds us that true love looks like Jesus - willing to be crucified for others. This isn't just a feel-good message; it's a radical call to transform how we approach relationships, ministry, and our entire life's purpose. Pastor Travis isn't just preaching - he's inviting us into a completely different way of living that puts others first and trusts God with everything.",
    "tags": [
        "Love",
        "Selflessness",
        "Sacrifice"
    ],
    "mainPoints": [
        "Love requires total surrender to God",
        "True love is about serving others, not serving ourselves",
        "Selflessness is a choice that transforms relationships and character"
    ],
    "versesMentioned": [
        {
            "verse": "1 Corinthians 13:4-8",
            "text": "Love is patient, love is kind. It does not envy, it does not boast, it is not proud. It does not dishonor others, it is not self-seeking, it is not easily angered, it keeps no record of wrongs. Love does not delight in evil but rejoices with the truth. It always protects, always trusts, always hopes, always perseveres. Love never fails.",
            "version": "NIV"
        },
        {
            "verse": "Jeremiah 10:6",
            "text": "No one is like you, Lord; you are great, and your name is mighty in power.",
            "version": "NIV"
        },
        {
            "verse": "Romans 8:38-39",
            "text": "For I am convinced that neither death nor life, neither angels nor demons, neither the present nor the future, nor any powers, neither height nor depth, nor anything else in all creation, will be able to separate us from the love of God that is in Christ Jesus our Lord.",
            "version": "NIV"
        },
        {
            "verse": "2 Timothy 3:2-5",
            "text": "People will be lovers of themselves, lovers of money, boastful, proud, abusive, disobedient to their parents, ungrateful, unholy, without love, unforgiving, slanderous, without self-control, brutal, not lovers of the good, treacherous, rash, conceited, lovers of pleasure rather than lovers of God— having a form of godliness but denying its power. Have nothing to do with such people.",
            "version": "NIV"
        },
        {
            "verse": "Philippians 2:3-4",
            "text": "Do nothing out of selfish ambition or vain conceit. Rather, in humility value others above yourselves, not looking to your own interests but each of you to the interests of the others.",
            "version": "NIV"
        },
        {
            "verse": "Mark 10:45",
            "text": "For even the Son of Man did not come to be served, but to serve, and to give his life as a ransom for many.",
            "version": "NIV"
        },
        {
            "verse": "John 15:13",
            "text": "Greater love has no one than this: to lay down one's life for one's friends.",
            "version": "NIV"
        },
        {
            "verse": "Romans 12:1",
            "text": "Therefore, I urge you, brothers and sisters, in view of God's mercy, to offer your bodies as a living sacrifice, holy and pleasing to God—this is your true and proper worship.",
            "version": "NIV"
        },
        {
            "verse": "1 John 1:9",
            "text": "If we confess our sins, he is faithful and just and will forgive us our sins and purify us from all unrighteousness.",
            "version": "NIV"
        },
        {
            "verse": "Luke 23:34",
            "text": "Jesus said, 'Father, forgive them, for they do not know what they are doing.'",
            "version": "NIV"
        },
        {
            "verse": "Matthew 25:23",
            "text": "His master replied, 'Well done, good and faithful servant! You have been faithful with a few things; I will put you in charge of many things. Come and share your master's happiness!'",
            "version": "NIV"
        }
    ],
    "dailyActionPlan": {
        "Monday": {
            "scripture": "Philippians 2:4: 'Each of you should look not only to your own interests, but also to the interests of others.'",
            "focus": "Recognizing opportunities to serve others",
            "action": "Make a deliberate effort to do something unexpectedly kind for someone today without expecting anything in return. This could be helping a coworker, sending an encouraging message, or doing a chore for a family member without being asked.",
            "prayer": "Lord, help me see beyond my own needs today. Open my eyes to opportunities to serve and love others selflessly, just as You have served me. Give me a heart that seeks to bless before being blessed. Amen."
        },
        "Tuesday": {
            "scripture": "Galatians 5:13: 'You, my brothers and sisters, were called to be free. But do not use your freedom to indulge the flesh; rather, serve one another humbly in love.'",
            "focus": "Understanding service as a calling",
            "action": "List three people in your life who might need extra support or encouragement. Reach out to at least one of them with a genuine offer of help or support.",
            "prayer": "Father, teach me what true service looks like. Help me move beyond my comfort zone and serve others with genuine love and humility. Show me where I can make a real difference today. Amen."
        },
        "Wednesday": {
            "scripture": "Matthew 20:28: 'Just as the Son of Man did not come to be served, but to serve, and to give his life as a ransom for many.'",
            "focus": "Modeling Christ-like servanthood",
            "action": "Identify an area in your life where you tend to be self-focused. Create a specific plan to shift your perspective from 'What can I get?' to 'What can I give?'",
            "prayer": "Jesus, transform my heart to reflect Your servant leadership. Help me decrease so that You may increase. Show me how to serve without seeking recognition or reward. Amen."
        },
        "Thursday": {
            "scripture": "1 Peter 4:10: 'Each of you should use whatever gift you have received to serve others, as faithful stewards of God's grace in its various forms.'",
            "focus": "Recognizing and using your unique gifts to serve",
            "action": "Take a spiritual gifts assessment or reflect on your natural talents. Brainstorm how you could use these gifts to serve your church, community, or family in a meaningful way.",
            "prayer": "God, reveal the gifts You've placed in me. Help me steward them not for my glory, but for Yours. Show me creative ways to serve and bless others using the abilities You've given me. Amen."
        },
        "Friday": {
            "scripture": "Galatians 6:2: 'Carry each other's burdens, and in this way you will fulfill the law of Christ.'",
            "focus": "Practicing empathetic service",
            "action": "Intentionally listen to someone's struggles without trying to fix their problem. Offer genuine compassion and support, focusing entirely on their needs.",
            "prayer": "Lord, give me a heart of compassion. Help me truly listen and bear burdens with others, not out of obligation, but out of genuine love. Make me an instrument of Your comfort and grace. Amen."
        },
        "Saturday": {
            "scripture": "Romans 12:10: 'Be devoted to one another in love. Honor one another above yourselves.'",
            "focus": "Cultivating a lifestyle of selfless love",
            "action": "Reflect on your week. Journal about moments where you chose selflessness and moments where you struggled. Develop a specific strategy to choose love in challenging relationships.",
            "prayer": "Heavenly Father, continue transforming my heart to reflect Your selfless love. Where I have been selfish, grant me repentance. Where I have struggled, give me Your strength. Make me more like Jesus today. Amen."
        }
    },
    "videoUrl": "https://www.youtube.com/embed/BINEGhS0lfc"
}