{
    "summaryText": "What an incredible message from Pastor Chris Durso about experiencing God's miracles! This sermon was a powerful reminder that faith isn't about explaining everything, but about believing what we've seen God do. Pastor Chris shared a deeply personal story about his son Dylan's miraculous healing from a rare blood disease, demonstrating that God shows up in unexpected ways. The core message? Don't let anyone diminish your miracle or experience with God! Sometimes people want logical explanations, but our God doesn't need to be explained - He just needs to be experienced. Pastor Chris challenges us to boldly declare 'I'm the man/woman' when it comes to God's transformative power in our lives. Whether it's healing, marriage restoration, or overcoming addiction, God is in the business of doing the impossible. The most powerful line? 'Your story, my glory' - meaning God uses our experiences to showcase His incredible love and power. If you've experienced a miracle, don't be silent! Share it, celebrate it, and let others see how good God truly is.",
    "tags": [
        "Miracles",
        "Faith",
        "Healing"
    ],
    "mainPoints": [
        "Not everything about God can be logically explained",
        "God notices and cares about your specific situation",
        "Your personal miracle is an illustration of God's glory"
    ],
    "versesMentioned": [
        {
            "verse": "John 9:1-11",
            "text": "As he went along, he saw a man blind from birth. His disciples asked him, 'Rabbi, who sinned, this man or his parents, that he was born blind?' 'Neither this man nor his parents sinned,' said Jesus, 'but this happened so that the works of God might be displayed in him.'",
            "version": "NIV"
        },
        {
            "verse": "First Corinthians 2:14",
            "text": "The person without the Spirit does not accept the things that come from the Spirit of God but considers them foolishness, and cannot understand them because they are discerned only through the Spirit.",
            "version": "NIV"
        },
        {
            "verse": "Hebrews 11:1",
            "text": "Now faith is confidence in what we hope for and assurance about what we do not see.",
            "version": "NIV"
        },
        {
            "verse": "Hebrews 11:6",
            "text": "And without faith it is impossible to please God, because anyone who comes to him must believe that he exists and that he rewards those who earnestly seek him.",
            "version": "NIV"
        },
        {
            "verse": "Romans 11:34",
            "text": "Who has known the mind of the Lord? Or who has been his counselor?",
            "version": "NIV"
        },
        {
            "verse": "First Corinthians 2:11",
            "text": "For who knows a person's thoughts except their own spirit within them? In the same way no one knows the thoughts of God except the Spirit of God.",
            "version": "NIV"
        }
    ],
    "dailyActionPlan": {
        "Monday": {
            "scripture": "Jeremiah 29:11: 'For I know the plans I have for you,' declares the Lord, 'plans to prosper you and not to harm you, plans to give you hope and a future.'",
            "focus": "Recognizing God's intentional work in your life",
            "action": "Spend time journaling about a current challenge. Ask God to help you see how He might be working in this situation, even if you can't understand everything.",
            "prayer": "Lord, help me trust Your plan even when I can't see the full picture. Give me faith to believe that You are working all things together for my good. Amen."
        },
        "Tuesday": {
            "scripture": "Psalm 86:10: 'For you are great and do marvelous deeds; you alone are God.'",
            "focus": "Acknowledging God's miraculous nature",
            "action": "Share a testimony of God's work in your life with someone. This could be a small miracle or a major life transformation.",
            "prayer": "Father, help me be bold in sharing the ways You have moved in my life. Use my story to demonstrate Your incredible love and power. Amen."
        },
        "Wednesday": {
            "scripture": "2 Corinthians 5:7: 'For we live by faith, not by sight.'",
            "focus": "Living beyond logical explanations",
            "action": "Identify an area in your life where you've been trying to logically understand God's work. Surrender this to Him and ask for increased faith.",
            "prayer": "God, forgive me for trying to limit You to my understanding. Increase my faith and help me trust You beyond what I can explain. Amen."
        },
        "Thursday": {
            "scripture": "Romans 8:28: 'And we know that in all things God works for the good of those who love him, who have been called according to his purpose.'",
            "focus": "Trusting God's redemptive process",
            "action": "Make a list of current challenges. Pray over each one, asking God to reveal how He might be working for good.",
            "prayer": "Lord, I trust that You are working even when I can't see it. Help me maintain hope and faith in Your perfect plan. Amen."
        },
        "Friday": {
            "scripture": "Ephesians 3:20: 'Now to him who is able to do immeasurably more than all we ask or imagine, according to his power that is at work within us.'",
            "focus": "Believing in God's limitless power",
            "action": "Spend time in prayer asking God to do something in your life that seems impossible. Write it down and commit to believing.",
            "prayer": "Father, expand my understanding of Your power. Help me believe for the impossible and trust in Your ability to move mountains. Amen."
        },
        "Saturday": {
            "scripture": "Psalm 103:2-3: 'Praise the Lord, my soul, and forget not all his benefits— who forgives all your sins and heals all your diseases.'",
            "focus": "Celebrating God's healing and restorative power",
            "action": "Reflect on past miracles in your life. Create a 'miracle journal' documenting times God has shown up for you.",
            "prayer": "Lord, thank You for Your incredible love and power. Help me never forget the ways You have moved in my life. Increase my faith and gratitude. Amen."
        }
    },
    "videoUrl": "https://www.youtube.com/embed/6GZiQHdWdec"
}